<template>
    <div>
        <div class="header-wrap">
            <h1>У каждой обследованной нашей собаки питомника , на персональной страничке имеются копии официальных
                тестов .</h1>
            <div class="vens"></div>
        </div>

        <h2 class="center-align"> Тесты на заболевание глаз</h2>


        <p>
            Мы уделяем очень большое внимание здоровью наших племенных собак. По правилам в России, для породы китайская
            хохлатая собака, нет обязательных тестов для допуска в разведение.

            Однако, во многих европейских странах ряд тестов является обязательным.</p>

        <p> Мы, следуя мировым тенденция также начали планомерное обследование собак, с целью в дальнейшем получить не
            только породных собак, но и максимально здоровых.
        </p>


        <p> Очень важный момент для породы - генетическая проверка на PLL (Первичный вывих хрусталика) и PRA
            (Прогрессирующая атрофия сетчатки собак).</p>

        <p> Благодаря современным технологиях по генетическому анализу (ДНК-тест) позволяет выявить дефектную
            (мутантную) копию гена и нормальную копию гена. Результат теста – это определение генотипа, по которому
            животных можно разделить на три группы: здоровые (гомозиготы по нормальной копии гена, NN или clear),
            носители (гетерозиготы, NM или carrier) и больные (гомозиготы по мутации, MM или affected).</p>

        <p>"PLL (Primary Lens Luxation - Первичное или наследственная люксация (смещение) хрусталика) хорошо известное
            болезненное и ведущее к слепоте наследственное заболевание глаз.</p>

        <p>Хрусталик удерживается на месте в глазу волокнами известными как зонулы (zonules). Если эти зонулы
            растягиваются или рвутся, хрусталик может выпадать с места или сместиться (luxate). Когда это случается
            часто требуется немедленная ветеринарная помощь, чтобы удалить смещенный хрусталик и предотвратить
            болезненную вторичную глаукому и иногда потерю зрения."</p>


        <p>"PRA - наследственный порок развития, при которой происходит дегенерация зрительных клеток сетчатки глаза
            (палочек и колбочек), что может привести к слепоте. Заболевание проявляется в нарушении функции
            фоторецепторов сетчатки, светочувствительного восприятия задней стенке глаза и падении остроты зрения у
            собак. Под термином "атрофия" подразумевается постепенное истончение или утрата тканей сетчатки. Как только
            процесс затронет нервные окончания, он станет необратимым, и восстановить зрение, будет невозможно.</p>

        <p> В сертификатах исследований пишут следующие результаты.</p>
        <p>
            PRA начинает проявляться на третьем-пятом годах жизни собаки и постепенно приводит к неизлечимой ранней
            слепоте собаки, наступление её остановить невозможно."</p>


        <p> Нами было принято решение использовать в племенной работе только тестированных собак. К сожалению у
            лабораторий нет единого обозначения результатов. Выглядит это по разному но означает одно и тоже. Если вы
            видите такие значения;</p>


        <div class="chips2">
            <h2 class="center-align">Информация по тестам</h2>
            <template>
                <el-table
                        :data="tableData"
                        stripe
                        style="width: 100%">
                    <el-table-column
                            prop="test"
                            label="Тест"
                            width="80">
                    </el-table-column>
                    <el-table-column
                            prop="result"
                            label="Возможный результат"
                            width="180">
                    </el-table-column>
                    <el-table-column
                            prop="conclusion"
                            label="Вывод">
                    </el-table-column>
                    <el-table-column
                            prop="recommendation"
                            label="Рекомендации">
                    </el-table-column>
                </el-table>
            </template>

        </div>
        <div class="header-wrap">
            <div class="vens"></div>
        </div>
        <h2 class="center-align">   Здоровье суставов</h2>
        <p>
            Также важный момент - здоровье суставов.</p><p>

            К сожалению, всё чаще встречаются собаки, которые имеют вывих коленной чашки (Patella), дисплазию тазобедренных суставов (HD) или дисплазию локтевых суставов (ED).</p><p>

            Данные проблемы имеют полигенную наследственность. То есть, даже от собаки, которая имеет полностью здоровые суставы могут родиться щенки, у которых в дальнейшем суставы могут быть не идеальны. Однако, в случае, если происходит вязка собак, имеющих высокую степень заболевания, то возможность получения щенков также с проблемными суставами - многократно возрастает.</p><p>

            Обследование на степень Patella (0, 1, 2, 3) происходит мануально, сертифицированным специалистом.

            Обследование на степень HD (A, B, C, D, Е), ED (0, 1, 2, 3) делается с помощью рентгеновского снимка.</p><p>

            При вязках собак не рекомендуется использовать собак со степенью Patella ниже 2, и со степенью HD\ED ниже C\2. Также в пару собаке со степенью подбирается собака с полностью здоровыми суставами.
    </p><p>
            Собаки, имеющие серьезные проблемы с суставами (например степень HD-D или HD-E), часто хромают и могут иметь хронические вывихи, не могут полноценно передвигаться, играть, а также могут иметь сильные боли. Часто эти проблемы проявляются не сразу, а у возрастных собак.

            При плохих степенях дисплазии многих собакам требуется хирургическое вмешательство.
        </p>
<div class="break"></div>
<div class="break"></div>
<div class="break"></div>
    </div>
</template>

<script>

    export default {
        name: "Health",
        data() {
            return {
                tableData: [
                    {
                        test: 'PLL',
                        result: 'clear, +/+, N/N (одно и тоже)',
                        conclusion: 'Риска заболевания нет. Ген не содержат мутацию.',
                        recommendation: ''
                    },
                    {
                        test: 'PRA',
                        result: 'clear, +/+, N/N (одно и тоже)',
                        conclusion: 'Риска заболевания нет. Ген не содержат мутацию.',
                        recommendation: ''
                    },
                    {
                        test: 'PLL',
                        result: 'carrier, -/+, N/PLL, (одно и тоже)',
                        conclusion: 'Риска заболевания нет. Гена содержит мутацию. Собака носитель.',
                        recommendation: 'Такому животному в пару нужно подбирать только чистую особь. Не имеющюю мутацию по данному признаку. Иначе велик риск получить больных животных.'
                    },
                    {
                        test: 'PRA',
                        result: 'carrier, -/+, N/PRA, (одно и тоже)',
                        conclusion: 'Риска заболевания нет. Гена содержит мутацию. Собака носитель.',
                        recommendation: 'Такому животному в пару нужно подбирать только чистую особь. Не имеющюю мутацию по данному признаку. Иначе велик риск получить больных животных.'
                    },
                    {
                        test: 'PLL/PLL',
                        result: 'affected, -/-, N/PLL, (одно и тоже)',
                        conclusion: 'Собака несет две копии мутантного гена и является гомозиготной по PRA-prcd. Собака поражена и всегда будет передавать копию мутировавшего гена своему потомству.',
                        recommendation: 'В разведении такие животные не используются!'
                    },
                    {
                        test: 'PRA/PRA',
                        result: 'affected, -/-, (одно и тоже)',
                        conclusion: 'Собака несет две копии мутантного гена и является гомозиготной по PRA-prcd. Собака поражена и всегда будет передавать копию мутировавшего гена своему потомству.',
                        recommendation: 'В разведении такие животные не используются!'
                    }
                ]
            }
        },
        metaInfo() {
            return {
                title: this.$title('Menu_Footer_Health')
            }
        },
    }
</script>

<style scoped>
    @import '../assets/front.css';
</style>
